app/controllers/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category = Category.new(params[:category])
    if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 26 Jul 2013 02:35:41 UTC +00:00], ["name", "Piano"], ["updated_at", Fri, 26 Jul 2013 02:35:41 UTC +00:00]]

  def show
    @listings = @category.listings.where(created_at: (DateTime.now - 7)..(DateTime.now + 1))
---
SELECT "listings".* FROM "listings" WHERE "listings"."category_id" = 1 AND ("listings"."created_at" BETWEEN '2013-07-25 20:58:11' AND '2013-08-02 20:58:11')

  def update
    if @category.update_attributes(params[:category])
---
UPDATE "categories" SET "name" = 'Piano ', "updated_at" = '2013-07-26 02:36:15.406111' WHERE "categories"."id" = 1

    def find_category
      @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]