app/controllers/listings_controller.rb

INSERT INTO "listings" ("category_id", "contact", "created_at", "description", "location", "pics", "pics2", "pics3", "price", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @listing = @category.listings.build(params[:listing])
    @listing.user = current_user
    if @listing.save

SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", "4"]]
---
  def show
    @listing = Listing.find(params[:id])

UPDATE "listings" SET "description" = 'Aspiring garage band seeks drummer.
---
  def update
    if @listing.update_attributes(params[:listing])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "7"]]
---
  def find_category
    @category = Category.find(params[:category_id])

SELECT "listings".* FROM "listings" WHERE "listings"."category_id" = 7 AND "listings"."id" = ? LIMIT 1  [["id", "9"]]
---
  def find_listing
    @listing = @category.listings.find(params[:id])